recepcionproduc/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@admin.colm', '$2y$13$zXmAJIK7WGTo4RmFjqWTa.evbh2YXYzf9oA32pPwwpw5RkRS7x.qe', 'EMftcgzKpIXob8kA5zxywZx5DIpH383U', 10, 1493733829, 1493733829)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;